# 목차
* [목차](#목차)
* [컴퓨터 과학](#컴퓨터-과학)
* [2진법](#2진법)
* [비트](#비트)
* [바이트](#바이트)
* [정보의 표현]
    - [ASCII](#ascii)
    - [RGB](#rgb)


## 컴퓨터 과학
```
컴퓨터 과학은 문제 해결에 대한 학문이다. 문제 해결은 입력(input)을 전달받아 출력(output)을 만들어내는 과정이다. 그 중간에 있는 과정이 바로 컴퓨터 과학이다.
```
* 이러한 입력과 출력을 표현하기 위해서는 모두가 동의할 약속(표준)이 필요하다.


## 2진법
```
오직 0과 1로만 데이터를 표현하는 것
```
* 컴퓨터는 오직 0과 1로만 데이터를 표현한다.
* 2진법에서는 두 개의 숫자만 있으므로 각 자리수가 2의 거듭제곱을 의미한다. 
![10진법과 2진법](https://cphinf.pstatic.net/mooc/20200607_209/1591512453958WWybq_PNG/mceclip2.png)
* 10진법의 3을 2진법으로 표현하면? 11이다.
![2진법](https://cphinf.pstatic.net/mooc/20200607_19/1591512545601J5dkm_PNG/mceclip3.png)
2<sup>1</sup> x 1 + 1 x 1 =3이다.

컴퓨터는 2진법에서 하나의 자릿수를 표현하는 단위를 비트(bit)라고 한다.


## 비트
```
비트(bit)는 binary digit의 약자로, 이진 숫자를 뜻한다. 0과 1, 두 가지 값만 가질 수 있는 측정 단위이다.
```
* 디지털 데이터를 여러 비트들로 나타냄으로써 두 가지 값만을 가지고도 많은 양의 정보를 저장할 수 있다. 
* 컴퓨터는 저장되어 있는 데이터를 수정하기 위해 비트에 수학적 연산을 수행할 수 있다.


## 바이트
```
바이트(byte)는 여덟 개의 비트가 모여 만들어진 것이다. 256개의 서로 다른 바이트가 존재할 수 있다.
```
* 비트 한 개는 많은 양의 데이터를 나타내기에 턱없이 부족하다.
* 여러 숫자 조합을 컴퓨터에 나타내기 위해 비트열을 사용한다. 
* 바이트가 모이면 더 큰 단위가 된다.
![비트열](https://cphinf.pstatic.net/mooc/20170712_75/1499826291828lfvjK_PNG/1.1_-03.png?type=w760)


## ASCII
```
ASCII(아스키코드/American Standard Code for Information Iterchange)는 문자를 숫자로 표현할 수 있도록 정해진 약속(표준)이다.
```
* 총 128개의 부호로 정의되어 있다.
![ASCII](https://cphinf.pstatic.net/mooc/20200607_151/159151581039966Tkp_PNG/mceclip0.png)
* A를 2진법으로 표현하면 65는 2<sup>6</sup>1 + 2<sup>5</sup>x0 + 2<sup>4</sup>x0 + 2<sup>3</sup>x0 + 2<sup>2</sup>x0 + 2<sup>1</sup>x0 + 1x1이므로 1000001로 표현할 수 있다.
```
A = 65 = 1000001
```
* 하지만 ASCII로는 다양한 문자를 표현하기에 충분하지 않았기 때문에 Unicode라는 표준을 만들어 더 다양한 다른 문자들도 표현 가능하도록 지원한다.
* Unicode는 이모티콘까지 표현할 수 있게 해주는데 😂 이 이모티콘을 2진법으로 표현하면 11111011000000010이다.

## RGB
```
픽셀은 세 가지 색(빨간색, 초록색, 파란색)을 서로 다른 비율로 조합하여 특정한 색을 갖는다. 이 색을 숫자로 표현하는 방식을 RGB(Red, Green, Blue)라고 한다.
```
* 우리가 보는 영상, 그림은 숫자를 빠르게 이어붙여 놓은 것이다. 
* 음악도 음표를 숫자로 표현할 수 있다.